<a href="https://colab.research.google.com/github/DevendraaK/Machine-Learning-and-Deep-Learning-Projects-/blob/main/AI_Pandas_%26_Matplotlib.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas --> Python Data Analysis

In [ ]:
import pandas as pd

1. Series --> 1D data
2. DataFrame --> 2D data (collection of 1D data)
3. Pannel --> 3D data (collection of 2D data)

In [ ]:
import numpy as np

In [ ]:
a = np.array([10,20,30,40,50])

In [ ]:
a

array([10, 20, 30, 40, 50])

In [ ]:
data = pd.Series(a)
print(data)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
data = pd.DataFrame({'name':pd.Series(['a','b','c','d']),
                     'age':pd.Series([10,20,30,40])})

In [ ]:
data

  name  age
0    a   10
1    b   20
2    c   30
3    d   40

In [ ]:
data.columns

Index(['name', 'age'], dtype='object')

In [ ]:
data.shape

(4, 2)

In [ ]:
import pandas as pd
data = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/breast-cancer-wisconsin/breast-cancer-wisconsin.data')

In [ ]:
data.shape

(698, 11)

In [ ]:
data.dtypes

1000025     int64
5           int64
1           int64
1.1         int64
1.2         int64
2           int64
1.3        object
3           int64
1.4         int64
1.5         int64
2.1         int64
dtype: object

In [ ]:
data.head(10)

   1000025  5   1  1.1  1.2  2 1.3  3  1.4  1.5  2.1
0  1002945  5   4    4    5  7  10  3    2    1    2
1  1015425  3   1    1    1  2   2  3    1    1    2
2  1016277  6   8    8    1  3   4  3    7    1    2
3  1017023  4   1    1    3  2   1  3    1    1    2
4  1017122  8  10   10    8  7  10  9    7    1    4
5  1018099  1   1    1    1  2  10  3    1    1    2
6  1018561  2   1    2    1  2   1  3    1    1    2
7  1033078  2   1    1    1  2   1  1    1    5    2
8  1033078  4   2    1    1  2   1  2    1    1    2
9  1035283  1   1    1    1  1   1  3    1    1    2

In [ ]:
data.tail()

     1000025  5   1  1.1  1.2  2 1.3   3  1.4  1.5  2.1
693   776715  3   1    1    1  3   2   1    1    1    2
694   841769  2   1    1    1  2   1   1    1    1    2
695   888820  5  10   10    3  7   3   8   10    2    4
696   897471  4   8    6    4  3   4  10    6    1    4
697   897471  4   8    8    5  4   5  10    4    1    4

In [ ]:
data.columns

Index(['1000025', '5', '1', '1.1', '1.2', '2', '1.3', '3', '1.4', '1.5',
       '2.1'],
      dtype='object')

In [ ]:
data.columns = ['Sample code number','Clump Thickness','Uniformity of Cell Size','Uniformity of Cell Shape','Marginal Adhesion','Single Epithelial Cell Size','Bare Nuclei','Bland Chromatin','Normal Nucleoli','Mitoses','class']

In [ ]:
data.columns

Index(['Sample code number', 'Clump Thickness', 'Uniformity of Cell Size',
       'Uniformity of Cell Shape', 'Marginal Adhesion',
       'Single Epithelial Cell Size', 'Bare Nuclei', 'Bland Chromatin',
       'Normal Nucleoli', 'Mitoses', 'class'],
      dtype='object')

In [ ]:
data.head()

   Sample code number  Clump Thickness  ...  Mitoses  class
0             1002945                5  ...        1      2
1             1015425                3  ...        1      2
2             1016277                6  ...        1      2
3             1017023                4  ...        1      2
4             1017122                8  ...        1      4

[5 rows x 11 columns]

In [ ]:
data.to_csv("breast_cancer_srm.csv")

In [ ]:
data = pd.read_csv("https://bit.ly/imdbratings")

In [ ]:
data.shape

(979, 6)

In [ ]:
data.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [ ]:
data.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

In [ ]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
data.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [ ]:
data = pd.read_csv("https://bit.ly/imdbratings",nrows=100,usecols=[1,3,4])

In [ ]:
data.shape

(100, 3)

In [ ]:
data.columns

Index(['title', 'genre', 'duration'], dtype='object')

In [ ]:
data = pd.read_csv("https://bit.ly/imdbratings")

In [ ]:
data.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [ ]:
data.columns

Index(['star_rating', 'title', 'content_rating', 'genre', 'duration',
       'actors_list'],
      dtype='object')

In [ ]:
data['duration']

0      142
1      175
2      200
3      152
4      154
      ...
974    116
975    118
976    138
977    114
978    126
Name: duration, Length: 979, dtype: int64

In [ ]:
data.duration

0      142
1      175
2      200
3      152
4      154
      ...
974    116
975    118
976    138
977    114
978    126
Name: duration, Length: 979, dtype: int64

In [ ]:
data[data.duration>200]

     star_rating  ...                                        actors_list
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...
630          7.7  ...  [u'Denzel Washington', u'Angela Bassett', u'De...
767          7.6  ...  [u'Spencer Tracy', u'Milton Berle', u'Ethel Me...

[11 rows x 6 columns]

In [ ]:
data[(data.duration>200) & (data.genre=='Adventure')]

     star_rating  ...                                        actors_list
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...

[5 rows x 6 columns]

In [ ]:
data[(data.duration>200) & ((data.genre=='Adventure')|(data.genre=='Crime'))]

     star_rating  ...                                        actors_list
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...

[6 rows x 6 columns]

In [ ]:
data[(data.duration>200) & (data.genre.isin(['Crime','Adventure','Action']))]

     star_rating  ...                                        actors_list
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
767          7.6  ...  [u'Spencer Tracy', u'Milton Berle', u'Ethel Me...

[7 rows x 6 columns]

In [ ]:
data.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [ ]:
data.genre.value_counts()

Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Sci-Fi         5
Thriller       5
Film-Noir      3
Family         2
History        1
Fantasy        1
Name: genre, dtype: int64

In [ ]:
data.star_rating.max(),data.star_rating.min(),data.star_rating.mean()

(9.3, 7.4, 7.8897854954034985)

In [ ]:
data.star_rating.agg(['min','max','mean','count','sum'])

min         7.400000
max         9.300000
mean        7.889785
count     979.000000
sum      7724.100000
Name: star_rating, dtype: float64

In [ ]:
data.star_rating.describe()

count    979.000000
mean       7.889785
std        0.336069
min        7.400000
25%        7.600000
50%        7.800000
75%        8.100000
max        9.300000
Name: star_rating, dtype: float64

In [ ]:
data[data.actors_list.str.contains('Khan')]

     star_rating  ...                                        actors_list
47           8.5  ...  [u'Darsheel Safary', u'Aamir Khan', u'Tanay Ch...
60           8.5  ...        [u'Aamir Khan', u'Madhavan', u'Mona Singh']
72           8.4  ...    [u'Aamir Khan', u'Soha Ali Khan', u'Siddharth']
89           8.4  ...  [u'Shah Rukh Khan', u'Gayatri Joshi', u'Kishor...
93           8.4  ...      [u'Shah Rukh Khan', u'Kajol', u'Amrish Puri']
109          8.3  ...  [u'Aamir Khan', u'Saif Ali Khan', u'Akshaye Kh...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
336          8.0  ...  [u'Suraj Sharma', u'Irrfan Khan', u'Adil Hussa...
373          8.0  ...    [u'Shah Rukh Khan', u'Kajol', u'Sheetal Menon']
718          7.6  ...  [u'Khalid Abdalla', u'Ahmad Khan Mahmoodzada',...

[10 rows x 6 columns]

In [ ]:
data[data.star_rating==data.star_rating.max()]

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...

[1 rows x 6 columns]

In [ ]:
data[data.actors_list.str.contains('Kapoor')]

     star_rating  ...                                        actors_list
133          8.3  ...  [u'Ranbir Kapoor', u'Priyanka Chopra', u'Ileana']

[1 rows x 6 columns]

In [ ]:
data = pd.read_csv("https://bit.ly/drinksbycountry")

In [ ]:
data.shape

(193, 6)

In [ ]:
data.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [ ]:
data.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [ ]:
data.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [ ]:
data.index

RangeIndex(start=0, stop=193, step=1)

In [ ]:
data.loc[0]

country                         Afghanistan
beer_servings                             0
spirit_servings                           0
wine_servings                             0
total_litres_of_pure_alcohol              0
continent                              Asia
Name: 0, dtype: object

In [ ]:
data.iloc[0]

country                         Afghanistan
beer_servings                             0
spirit_servings                           0
wine_servings                             0
total_litres_of_pure_alcohol              0
continent                              Asia
Name: 0, dtype: object

In [ ]:
data.set_index('country',inplace=True)

In [ ]:
data.head()

             beer_servings  ...  continent
country                     ...
Afghanistan              0  ...       Asia
Albania                 89  ...     Europe
Algeria                 25  ...     Africa
Andorra                245  ...     Europe
Angola                 217  ...     Africa

[5 rows x 5 columns]

In [ ]:
data.loc['India']

beer_servings                      9
spirit_servings                  114
wine_servings                      0
total_litres_of_pure_alcohol     2.2
continent                       Asia
Name: India, dtype: object

In [ ]:
data.iloc[1]

beer_servings                       89
spirit_servings                    132
wine_servings                       54
total_litres_of_pure_alcohol       4.9
continent                       Europe
Name: Albania, dtype: object

In [ ]:
data.reset_index(inplace=True)

In [ ]:
data.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [ ]:
data=pd.read_csv("https://bit.ly/uforeports")

In [ ]:
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
data.shape

(18241, 5)

In [ ]:
data.dropna(how="any",axis=1).shape,data.dropna(how='any',axis=0).shape

((18241, 2), (2486, 5))

In [ ]:
data.dropna(how='any',axis=1).columns

Index(['State', 'Time'], dtype='object')

In [ ]:
data.fillna("Kuch bhi")

                       City Colors Reported  ... State              Time
0                    Ithaca        Kuch bhi  ...    NY    6/1/1930 22:00
1               Willingboro        Kuch bhi  ...    NJ   6/30/1930 20:00
2                   Holyoke        Kuch bhi  ...    CO   2/15/1931 14:00
3                   Abilene        Kuch bhi  ...    KS    6/1/1931 13:00
4      New York Worlds Fair        Kuch bhi  ...    NY   4/18/1933 19:00
...                     ...             ...  ...   ...               ...
18236            Grant Park        Kuch bhi  ...    IL  12/31/2000 23:00
18237           Spirit Lake        Kuch bhi  ...    IA  12/31/2000 23:00
18238           Eagle River        Kuch bhi  ...    WI  12/31/2000 23:45
18239           Eagle River             RED  ...    WI  12/31/2000 23:45
18240                  Ybor        Kuch bhi  ...    FL  12/31/2000 23:59

[18241 rows x 5 columns]

In [ ]:
data.drop('City',axis=1)

      Colors Reported Shape Reported State              Time
0                 NaN       TRIANGLE    NY    6/1/1930 22:00
1                 NaN          OTHER    NJ   6/30/1930 20:00
2                 NaN           OVAL    CO   2/15/1931 14:00
3                 NaN           DISK    KS    6/1/1931 13:00
4                 NaN          LIGHT    NY   4/18/1933 19:00
...               ...            ...   ...               ...
18236             NaN       TRIANGLE    IL  12/31/2000 23:00
18237             NaN           DISK    IA  12/31/2000 23:00
18238             NaN            NaN    WI  12/31/2000 23:45
18239             RED          LIGHT    WI  12/31/2000 23:45
18240             NaN           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [ ]:
data.drop([0,1,2,3],axis=0)

                       City Colors Reported  ... State              Time
4      New York Worlds Fair             NaN  ...    NY   4/18/1933 19:00
5               Valley City             NaN  ...    ND   9/15/1934 15:30
6               Crater Lake             NaN  ...    CA    6/15/1935 0:00
7                      Alma             NaN  ...    MI    7/15/1936 0:00
8                   Eklutna             NaN  ...    AK  10/15/1936 17:00
...                     ...             ...  ...   ...               ...
18236            Grant Park             NaN  ...    IL  12/31/2000 23:00
18237           Spirit Lake             NaN  ...    IA  12/31/2000 23:00
18238           Eagle River             NaN  ...    WI  12/31/2000 23:45
18239           Eagle River             RED  ...    WI  12/31/2000 23:45
18240                  Ybor             NaN  ...    FL  12/31/2000 23:59

[18237 rows x 5 columns]